#!/usr/bin/perl
#=======================================================================================
# 初期設定
#=======================================================================================

# UTF-8対応（Encodeモジュールを使用）
use Encode qw/encode decode/;
use utf8;

# メール機能の設定
	$mail_ck = 0;                       # サイトのメール送信機能（0＝使わない、1＝使う）
	$sendmail = '/usr/sbin/sendmail';   # sendmailのパス
	$subject = 'PatiPati通知';          # メールタイトル
	# メール宛先（複数登録できます。改行しないように @mailtos = ('test@xx.xx.xx'); のようにしてください）
	# メール宛先が多すぎるとサーバー負荷が大きくなります。多くても20個ぐらいにするようお勧めします。
	@mailtos = ('mail@xx.xx.xx','test@xx.xx.xx');

# 管理者パスワード
$admin_pass = 'test';

# サーバー（シェル使用について：0＝否、1＝可（niftyなどなど））
$shell_use = 0;

# 全体の連続拍手数です。0を指定すると無効。
$clap_su = 20;

# 連続拍手制限時間。1分を単位で設定できます。例：パティパティの仕様上、これを0に指定しても1時間（というか時間を単位で使うまで）連続拍手できます。
$clap_kankaku = 0;

# サイト以外の送信フォーム数
$sub_su = 5;

# クッキー有効期間（日数）
$cook_yuko = 60;

# サイト字数制限。半角文字数で指定。例：200なら全角文字100文字まで。0を指定すると無効。
$com_jisu = 600;

# NGワード。指定した単語を含むメッセージを弾きます。
# デフォルトで設定されている「href=」と「URL=」はスパム対策となっていますので削除しないで使ってください。
@ngs = ('href=','URL=');

# NGワードへのサイト。$ng_ck_msg = '';にするとノーメッセージで弾かれたように見えます。
$ng_ck_msg = 'NGワードが入力されているため送信できません。';

# スパムコード対策（変数：半角のみでひらがな・カタカナ・漢字など含まないことを引っかけないようにです）
# $delspamに「1」をセットするとスパム対策有効に。「0」をセットすると変数：半角のみ引っかかります。
# デフォルトでは「引っかける」になっています。
# 変数：半角スパムコード対策（0＝使わない、1＝使う）
$delspam = 0;

# ブラックリスト機能（0＝使わない、1＝使う）
$ip_ck = 1;

# ブラックリストへのサイト。$ip_ck_msg = '';にするとノーメッセージで弾かれたように見えます。
$ip_ck_msg = 'あなたはブラックリストに登録されています。';

# ブラックリストファイル（ディレクトリはログディレクトリと同じところにしてください）
$ip_ck_file = 'logs/blist.txt';

# ブラックリスト件数。0なら無効。でいくつか値を入れても200件以上にしたほぼ無意味です。
$ip_ck_su = 50;

# 拍手後表示するファイルのデータ（複数可能）
@location_files = ('thanks.html','thanks2.html','thanks3.html','thanks4.html','thanks5.html');

# 拍手後の表示方法（0＝しない（時間置く）、1＝する、2＝しない（時間置かない））
$locate_rand = 0;

# 連続拍手超過時表示
$last_file = 'last.html';

# グラフ画像
$graph = 'img/graph.gif';
# グラフ画像の縮小率の比率。0か大きすぎる数を指定、縮小が長くなりすぎますが登録数値が大きくしてください。
$hiritsu = 1;

# ログディレクトリ名（※ セキュリティのため、後から名前を変更することを推奨します）
# 例：$log_dir = 'patdata/';また、ここの修正を行ったときは、$ip_ck_fileと$Gindexも
# ディレクトリ名もいっしょに変更してください。

$log_dir = 'logs/';

# ログ保存しておく月数
$log_max = 12;

# ディレクトリガード。index.htmlを作成。
$Gindex = 'logs/index.html';

# ファイルロック
$lockkey = 1; # ファイルロック番号 (0=no 1=flock関数 2=mkdir関数)
$lock_file = "lock/lock.txt"; # ロックファイル名

# エラーファイル
$error_file = 'error.html';

# CGIファイル名
$cgi_file = 'index.cgi';

#----------------ver4.0以降追加された
# ビュー画面表示（0＝表示しない、1＝表示する）
$view_pre = 0;

#----------------ver4.3+phase5 以降追加された

# スパムコード対策、URLを含んでいても弾きます。「※ NGワードで「http」を
# 指定しても無効となるためのスパム有効です）
# URL拍手キャンセル・スパムコード対策（0＝使わない、1＝使う）
$kickurl = 0;


#=======================================================================================


return 1;
